var test_list = {
    "臺北市": ["士林", "大同", "中山", "古亭", "松山", "陽明", "萬華"],
    "基隆市": ["基隆"],
    "新北市": ["三重", "土城", "永和", "汐止", "板橋", "林口", "淡水", "富貴角", "菜寮", "新店", "新莊", "萬里"],
    "桃園市": ["大園", "中壢", "平鎮", "桃園", "龍潭", "觀音"],
    "新竹縣市": ["新竹", "竹東", "湖口"],
    "苗栗縣": ["三義", "苗栗", "頭份"],
    "臺中市": ["大里", "西屯", "沙鹿", "忠明", "豐原"],
    "彰化縣": ["二林", "彰化", "線西", "大城"],
    "南投縣": ["竹山", "南投", "埔里"],
    "雲林縣": ["斗六", "崙背", "麥寮", "臺西"],
    "嘉義縣市": ["嘉義", "朴子", "新港"],
    "臺南市": ["安南", "善化", "新營", "臺南"],
    "高雄市": ["美濃", "橋頭", "楠梓", "仁武", "左營", "前金", "鳳山", "復興", "前鎮", "小港", "大寮", "林園"],
    "屏東縣": ["屏東", "恆春", "潮州"],
    "宜蘭縣": ["冬山", "宜蘭"],
    "花蓮縣": ["花蓮"],
    "臺東縣": ["臺東", "關山"],
    "離島地區": ["金門", "馬公", "馬祖"]
};
var tab_list = {
    "臺北市": "Taipei",
    "基隆市": "Keelung",
    "新北市": "New_Taipei",
    "桃園市": "Taoyuan",
    "新竹縣市": "Hsinchu",
    "苗栗縣": "Miaoli",
    "臺中市": "Taichung",
    "彰化縣": "Changhua",
    "南投縣": "Nantou",
    "雲林縣": "Yunlin",
    "嘉義縣市": "Chiayi",
    "臺南市": "Tainan",
    "高雄市": "Kaohsiung",
    "屏東縣": "Pingtung",
    "宜蘭縣": "Yilan",
    "花蓮縣": "Hualien",
    "臺東縣": "Taitung",
    "離島地區": "Outlying_islands"
}

var pollutant_dict = {
    "臭氧八小時": "臭氧 (O₃)",
    "細懸浮微粒": "細懸浮微粒(PM₂.₅)",
    "懸浮微粒": "懸浮微粒(PM₁₀)",
    "二氧化氮":"二氧化氮(NO₂)"
}