var test_list = {
    "臺北市": ["陽明山", "台北"],
    "新北市": ["磺潭", "石門", "三芝", "石崩山", "茂林", "金山", "野柳", "大鵬", "大坪", "萬里", "澳底", "貢寮", "龍門", "雙溪", "三港", "板橋"],
    "基隆市": ["基隆", "彭佳嶼"],
    "桃園市": ["石門水庫", "龍潭"],
    "新竹市": ["清華大學", "新竹"],
    "新竹縣市": ["清華大學", "新竹", "竹北"],
    "苗栗縣": ["苗栗"],
    "臺中市": ["台中"],
    "南投縣": ["合歡山", "南投"],
    "彰化縣": ["彰化"],
    "雲林縣": ["雲林"],
    "嘉義縣市": ["嘉義", "阿里山"],
    "臺南市": ["台南"],
    "高雄市": ["高雄"],
    "屏東縣": ["恆春", "龍泉", "大光", "墾丁", "後壁湖", "滿州", "屏東市", "小琉球"],
    "宜蘭縣": ["宜蘭", "頭城"],
    "花蓮縣": ["花蓮"],
    "臺東縣": ["台東", "綠島", "椰油", "貯存場大門口", "蘭嶼氣象站"],
    "澎湖縣": ["澎湖", "七美"],
    "金門縣": ["金門氣象站", "榮湖淨水廠"],
    "連江縣": ["東引", "馬祖"]
};

var station_list = ["磺潭", "彭佳嶼", "石門水庫", "清華大學", "石門", "三芝", "石崩山", "茂林", "金山", "野柳", "大鵬", "陽明山", "大坪", "萬里", "台北", "宜蘭", "龍潭", "台中", "台東", "綠島", "高雄", "林園", "牡丹水庫", "恆春", "龍泉", "大光", "墾丁", "後壁湖", "澳底", "貢寮", "阿里山", "金門氣象站", "榮湖淨水廠", "椰油", "新營", "台南", "南化水庫", "龍門", "雙溪", "三港", "新竹", "花蓮", "澎湖", "七美", "東引", "馬祖", "滿州", "板橋", "屏東市", "小琉球", "基隆", "頭城", "竹北", "苗栗", "鯉魚潭水庫", "合歡山", "南投", "彰化", "雲林", "麥寮", "嘉義", "貯存場大門口", "蘭嶼氣象站"]

var nuclear_list = {
    "核一廠": ["石門", "三芝", "石崩山", "茂林", "陽明山"],
    "核二廠": ["磺潭", "金山", "野柳", "大鵬", "大坪", "萬里"],
    "核三廠": ["恆春", "龍泉", "大光", "墾丁", "後壁湖", "滿州"],
    "龍門核能電廠": ["澳底", "貢寮", "龍門", "雙溪", "三港"]
}

var tab_list = {
    "臺北市": "Taipei",
    "基隆市": "Keelung",
    "新北市": "New_Taipei",
    "桃園市": "Taoyuan",
    "新竹縣市": "Hsinchu",
    "苗栗縣": "Miaoli",
    "臺中市": "Taichung",
    "彰化縣": "Changhua",
    "南投縣": "Nantou",
    "雲林縣": "Yunlin",
    "嘉義縣市": "Chiayi",
    "臺南市": "Tainan ",
    "高雄市": "Kaohsiung ",
    "屏東縣": "Pingtung ",
    "宜蘭縣": "Yilan",
    "花蓮縣": "Hualien",
    "臺東縣": "Taitung",
    "澎湖縣": "Penghu",
    "金門縣": "Kinmen",
    "連江縣": "Lienchiang"
}