var test_list = {
    "北部地區": ["臺北", "鞍部", "基隆", "板橋", "淡水", "桃園", "新屋", "新竹"],
    "中部地區": ["苗栗", "臺中", "沙鹿", "彰化", "日月潭", "玉山", "南投", "斗六"],
    "南部地區": ["嘉義", "朴子", "阿里山", "塔塔加", "臺南", "新營", "高雄", "橋頭", "屏東", "恆春"],
    "東部地區": ["宜蘭", "花蓮", "臺東", "成功", "蘭嶼"],
    "離島地區": ["金門", "馬祖", "澎湖"]
};
var tab_list = {
    "北部地區": "Northen",
    "中部地區": "Central",
    "南部地區": "Southern",
    "東部地區": 'Eastern',
    "離島地區": "Islands"
}

var pollutant_dict = {
    "臭氧八小時": "臭氧 (O₃)",
    "細懸浮微粒": "細懸浮微粒(PM₂.₅)",
    "懸浮微粒": "懸浮微粒(PM₁₀)"
}